Back_On_Rails/app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @items = Item.paginate(page: params[:page], per_page: 5)

INSERT INTO "items" ("created_at", "updated_at", "user_id", "name", "description") VALUES (?, ?, ?, ?, ?)  [["created_at", "2018-11-20 21:52:51.134786"], ["updated_at", "2018-11-20 21:52:51.134786"], ["user_id", 15], ["name", "whatever"], ["description", "whatever i want"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def create
    @item = Item.new(allowed_params)
    @item.user = current_user
    if @item.save
      if params[:tag_ids]
        @item.tags << Tag.find(params[:tag_ids])

UPDATE "items" SET "item_pictures" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["item_pictures", "[\"20180924_123306.jpg\",\"schedule.jpg\"]"], ["updated_at", "2018-11-21 03:40:19.856979"], ["id", 2]]
---
  def update
    if @item.update(allowed_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
  def show_items
    @items = User.find(params[:id_param]).items