Back_On_Rails/app/controllers/profiles_controller.rb

  def new
    @user = User.find(params[:user_id])
    @profile = @user.create_profile
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "profiles" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2018-10-30 19:52:41.950299"], ["updated_at", "2018-10-30 19:52:41.950299"], ["user_id", 6]]

  def edit
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def update
    @user = User.find(params[:user_id])
    if @user.profile.update(profile_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "profiles" SET "first_name" = ?, "last_name" = ?, "phone_number" = ?, "profile_picture" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["first_name", ""], ["last_name", ""], ["phone_number", ""], ["profile_picture", "14677876_10202174183553929_1564461760_o.jpg"], ["updated_at", "2018-11-18 21:56:06.169955"], ["id", 6]]