Back_On_Rails/app/controllers/user_reviews_controller.rb

        def set_reviewee
            @reviewee = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]