Back_On_Rails/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(allowed_params)
    if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    session[:user_id] = nil
    @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def add_friend
    @friend = User.find(params[:friend])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def add_follower
    @friend = User.find(params[:friend])