Back_On_Rails/app/models/item.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."item_id" = ?  [["item_id", 1]]
---
    def isBorrowed?
        borrow_records = self.transactions
        borrow_records.each do |transaction|