app/views/users/my_friends.html.erb

SELECT COUNT(*) FROM "friendships" WHERE "friendships"."user_id" = ?  [["user_id", 1]]
---

	<% if current_user.friendships.size > 0 %>