app/views/users/my_followers.html.erb

SELECT COUNT(*) FROM "friendships" WHERE "friendships"."friend_id" = ?  [["friend_id", 1]]
---

	<% if Friendship.where(:friend_id => current_user.id).all.count > 0 %>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	          <td>
	            <%= User.find(follower.user_id).username %>