app/views/welcome/index.html.erb

  	              <li role="separator" class="divider"></li>
  	              <li align = "center"><%= link_to Friendship.where(:friend_id => current_user.id).all.count.to_s + ' Followers', main_app.my_followers_path %></li>
---
SELECT COUNT(*) FROM "friendships" WHERE "friendships"."friend_id" = ?  [["friend_id", 1]]