Back_On_Rails/app/views/user_reviews/index.html.erb


    <% @reviewee.reviews_of_self.each do |review| %>
---
SELECT "user_reviews".* FROM "user_reviews" WHERE "user_reviews"."reviewee_id" = ?  [["reviewee_id", 10]]