Back_On_Rails/app/views/items/index.html.erb

SELECT "items".* FROM "items"
---
          <div class="well">
            <% if item.item_pictures.any? %>