app/views/user_reviews/index.html.erb

SELECT "user_reviews".* FROM "user_reviews" WHERE "user_reviews"."reviewee_id" = ?  [["reviewee_id", 2]]
---
        <div class="review-block">
            <% @reviewee.reviews_of_self.each do |review| %>