app/views/items/_form.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "places".* FROM "places"
---
        <div class = "col-sm-8">
          <%= form.collection_select(:place_id, Place.select{|p| p.user == current_user}, :id, :address, {:include_blank => ("Please select an address"), hide_label: true}, class: "form-control") %>

SELECT "tags".* FROM "tags"
---
          <div class = "col-sm-offset-2 col-sm-10">
            <%  Tag.all.each do |role| %>