app/views/items/index.html.erb

SELECT COUNT(*) FROM "items"
SELECT "items".* FROM "items"
---
            <div class="well">
              <% if item.item_pictures.any? %>