app/views/items/show.html.erb

SELECT  1 AS one FROM "tags" INNER JOIN "item_tags" ON "tags"."id" = "item_tags"."tag_id" WHERE "item_tags"."item_id" = ? LIMIT ?  [["item_id", 3], ["LIMIT", 1]]
---
	</div>
	<% if @item.tags.any? %>