app/controllers/item_reviews_controller.rb

INSERT INTO "item_reviews" ("user_id", "item_id", "rating", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["item_id", 1], ["rating", 3], ["comment", "good hammer"], ["created_at", "2018-11-20 20:36:14.773936"], ["updated_at", "2018-11-20 20:36:14.773936"]]
---
    def create
        @item_review = ItemReview.new
        @item_review.user = @user
        @item_review.item = @item
        @item_review.rating = params[:item_review][:rating]
        @item_review.comment = params[:item_review][:comment]

        isSaved = @item_review.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        def set_item
            @item = Item.find(params[:item_id])