app/controllers/items_controller.rb

  def index
    @items = Item.paginate(page: params[:page], per_page: 5)
---
SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"

  def create
    @item = Item.new(allowed_params)
    @item.user = current_user
    if @item.save
      if params[:tag_ids]
        @item.tags << Tag.find(params[:tag_ids])
---
INSERT INTO "items" ("created_at", "updated_at", "name", "description", "user_id", "item_pictures", "place_id") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    if @item.update(allowed_params)
      if @item.tags.any?
        @item.tags.delete(@item.tags)
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 2]]

  def search
    if params[:search_item]
      if params[:tag_id] != ''
        @item_by_name = Item.joins(:tags).where('tags.id IS ? AND items.name LIKE ?',
                                                "#{params[:tag_id]}", "%#{params[:search_item]}%")
        @item_by_description = Item.joins(:tags).where('tags.id IS ? AND items.description LIKE ?',
                                                       "#{params[:tag_id]}", "%#{params[:search_item]}%")
        @items = (@item_by_name + @item_by_description).uniq
        gon.places = @items.map{|i| i.place}
      else
        @item_by_name = Item.where('name LIKE ?', "%#{params[:search_item]}%")
        @item_by_description = Item.where('description LIKE ?', "%#{params[:search_item]}%")
---
SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def show_items
    @items = User.find(params[:id_param]).items
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def get_all_item_borrowers
        @all_item_borrowers = Array.new
        item_transactions = @item.transactions
        item_transactions.each do |transaction|
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."item_id" = ?  [["item_id", 3]]