app/controllers/places_controller.rb

SELECT "places".* FROM "places"
SELECT COUNT(*) FROM "items" WHERE "items"."place_id" = ?  [["place_id", 1]]
---
  def index
    @places = Place.all.select {|p| p.items.count > 0}

INSERT INTO "places" ("address", "latitude", "longitude", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["address", "386 Yonge St"], ["latitude", 43.659329], ["longitude", -79.3826747], ["created_at", "2018-11-15 01:05:11.890222"], ["updated_at", "2018-11-15 01:05:11.890222"], ["user_id", 1]]
---
  def create
    @place = Place.new(place_params)
    @place.user = current_user
    if @place.save

SELECT  "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "places" WHERE "places"."id" = ?  [["id", 3]]
---
  def destroy
    @place = Place.find(params[:id])
    @place.destroy