app/controllers/tags_controller.rb

SELECT  "tags".* FROM "tags" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "tags"
---
  def index
    @tags = Tag.paginate(page: params[:page], per_page: 5)