app/controllers/transactions_controller.rb

    def create
        @transaction = Transaction.new
        @transaction.borrower = @user
        @transaction.item = @item
        @transaction.lender = @item.user
        @transaction.start_date = params[:transaction][:start_date]
        @transaction.end_date = params[:transaction][:end_date]
        @transaction.isReturned = 0
        @transaction.isApproved = 0
        isSaved = @transaction.save
---
INSERT INTO "transactions" ("item_id", "start_date", "end_date", "isReturned", "lender_id", "borrower_id", "isApproved") VALUES (?, ?, ?, ?, ?, ?, ?)  [["item_id", 1], ["start_date", "2018-11-20"], ["end_date", "2018-12-31"], ["isReturned", 0], ["lender_id", 1], ["borrower_id", 2], ["isApproved", 0]]

    def update
        @transaction = Transaction.find(params[:id])
        #assign_attributes will only assign to model attributes if it exists in request_params hash
        @transaction.assign_attributes(request_params)
        @pending_borrow_transactions = getPendingTransactions(@borrow_transactions)
        @pending_lend_transactions = getPendingTransactions(@lend_transactions)

        # SKIP PERIOD VALIDATIONS on rejecting transaction and marking item returned
        if(params[:transaction][:isApproved]=='2' ||
            params[:transaction][:isReturned]=='1')
            @transaction.skip_period_validation = true
        end

        isSaved = @transaction.save
---
SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "transactions" SET "isReturned" = ? WHERE "transactions"."id" = ?  [["isReturned", 1], ["id", 1]]

        def set_item
            @item = Item.find(params[:item_id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]