app/controllers/user_reviews_controller.rb

    def create
        @user_review = UserReview.new
        @user_review.user = @user
        @user_review.reviewee = @reviewee
        @user_review.rating = params[:user_review][:rating]
        @user_review.comment = params[:user_review][:comment]

        isSaved = @user_review.save
---
INSERT INTO "user_reviews" ("user_id", "reviewee_id", "rating", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["reviewee_id", 2], ["rating", 5], ["comment", "good guy"], ["created_at", "2018-11-20 20:38:26.521551"], ["updated_at", "2018-11-20 20:38:26.521551"]]

        def set_reviewee
            @reviewee = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]