app/controllers/users_controller.rb

  def create
    @user = User.new(allowed_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def search
    if params[:search_param].blank?
      flash[:notice] = "You have entered an empty search string"
    else
      @users = User.search(params[:search_param])
---
SELECT "users".* FROM "users" WHERE (username like '%abcd%')

  def add_friend
    @friend = User.find(params[:friend])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def add_follower
    @friend = User.find(params[:friend])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def my_places
    @places = Place.where(user: current_user).order('created_at DESC')
---
SELECT "places".* FROM "places" WHERE "places"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]