app/controllers/welcome_controller.rb

SELECT "places".* FROM "places"
SELECT COUNT(*) FROM "items" WHERE "items"."place_id" = ?  [["place_id", 1]]
---
  def index
    @places = Place.all.select {|p| p.items.count > 0}