app/models/item_review.rb

    def user_cannot_have_multiple_reviews_of_same_item
        review_user = self.user
        review_item = self.item
        all_reviews_by_user = review_user.item_reviews

        all_reviews_by_user.each do |review|
---
SELECT "item_reviews".* FROM "item_reviews" WHERE "item_reviews"."user_id" = ?  [["user_id", 2]]