app/models/item.rb

SELECT "transactions".* FROM "transactions" WHERE "transactions"."item_id" = ?  [["item_id", 1]]
---
    def get_ongoing_transactions
        item_transactions = self.transactions
        ongoing_transactions = Array.new
        item_transactions.each do |transaction|

SELECT "item_reviews".* FROM "item_reviews" WHERE "item_reviews"."item_id" = ?  [["item_id", 3]]
---
    def get_average_rating
        total_ratings = 0
        n = 0
        all_reviews = self.item_reviews
        all_reviews.each do |review|