app/models/transaction.rb

    def validate_transaction_period

        # CHECK BASIC PERIOD ENDPOINTS
        if(self.start_date.nil? || self.end_date.nil?)
            return nil
        end
        if(self.start_date < Date.current)
            # Invalid Period
            errors.add(:start_date, "cannot be in the past")
            return nil
        end
        if(self.start_date > self.end_date)
            # Invalid Period
            errors.add(:start_date, "cannot be after end date")
            return nil
        end

        # CHECK FOR TRANSACTION PERIOD OVERLAPS
        transaction_item = self.item
        all_transactions_for_item = transaction_item.transactions
        all_transactions_for_item.each do |transaction|
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."item_id" = ?  [["item_id", 1]]