app/models/user_review.rb

    def user_has_past_transaction_with_reviewee
        user = self.user
        reviewee = self.reviewee

        transactions = Transaction.where(borrower: user, lender: reviewee, isApproved: 1)
                                  .where("start_date <= ?", Date.current)
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."lender_id" = ?  [["lender_id", 2]]

    def user_cannot_have_multiple_reviews_of_same_reviewee
        user = self.user
        reviewee = self.reviewee
        user_reviews = user.user_reviews

        user_reviews.each do |review|
---
SELECT "user_reviews".* FROM "user_reviews" WHERE "user_reviews"."user_id" = ?  [["user_id", 2]]