app/models/user.rb

  def self.search(param)
---
SELECT "users".* FROM "users" WHERE (username like '%abcd%')