app/views/places/show.html.erb

  <tbody>
    <% @place.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."place_id" = ?  [["place_id", 1]]