app/views/layouts/_navigation.html.erb

								<li align = "center"><%= link_to current_user.friends.count.to_s + ' Following', main_app.my_friends_path %></li>
	              				<li align = "center"><%= link_to Friendship.where(:friend_id => current_user.id).all.count.to_s + ' Followers', main_app.my_followers_path %></li>
---
SELECT COUNT(*) FROM "friendships" WHERE "friendships"."friend_id" = ?  [["friend_id", 1]]